src/InformationRegisters/ЭлектронныеПодписиКЭДО/ЭлектронныеПодписиКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭлектронныеПодписиКЭДО</name>
  <dimensions>
    <name>ПодписанныйОбъект</name>
    <type>
      <types>DefinedType.ПодписанныйОбъект</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьОтпечаток</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьДатаПодписи</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьМЧД</name>
    <type>
      <types>CatalogRef.УдалитьМашиночитаемыеДоверенностиКЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РольПодписанта</name>
    <type>
      <types>EnumRef.РолиПодписантовКЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПодписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЭлектронныеПодписи/ЭлектронныеПодписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭлектронныеПодписи</name>
  <resources>
    <name>ТребуетсяПроверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипПодписи</name>
    <type>
      <types>EnumRef.ТипыПодписиКриптографии</types>
    </type>
  </resources>
  <resources>
    <name>СрокДействияПоследнейМеткиВремени</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПроверкиПодписи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИмяФайлаПодписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>260</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>КомуВыданСертификат</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Отпечаток</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ПодписьВерна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПодписи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>УстановившийПодпись</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>ОшибкаПриАвтоматическомПродлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПропуститьПриПродлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПодписи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьМатематическиВерна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаМатематическойПроверкиПодписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаПроверкиДополнительныхАтрибутов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеАтрибутыПровереныВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторРучнойПроверкиДополнительныхАтрибутов</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеРучнойПроверкиДополнительныхАтрибутов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПодписанныйОбъект</name>
    <type>
      <types>DefinedType.ПодписанныйОбъект</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЭлектронныеПодписиМЧД/ЭлектронныеПодписиМЧД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭлектронныеПодписиМЧД</name>
  <comment>Электронные подписи с указанием машиночитаемой доверенности</comment>
  <resources>
    <name>ТребуетсяПроверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Верна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодписантСоответствуетПредставителю</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СовместныеПолномочия</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СовместныеПолномочияВерны</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПротоколПроверки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>СтатусВернаУстановленВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановившийСтатусВерна</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПодписанныйОбъект</name>
    <type>
      <types>DefinedType.ПодписанныйОбъект</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПодписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МашиночитаемаяДоверенность</name>
    <type>
      <types>CatalogRef.МашиночитаемыеДоверенности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ЭлектроннаяПодписьКЭДО/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция УстановленныеПодписи(Объект, ПорядковыйНомер = Неопределено) Экспорт
	
	Подписи = ЭлектроннаяПодпись.УстановленныеПодписи(Объект, ПорядковыйНомер, Истина);
	РеквизитыПодписей = РеквизитыУстановленныхПодписей(Объект);
	
	НомерПодписи = 1;
	Для Каждого СвойстваПодписи Из Подписи Цикл
		
		СвойстваПодписи.Вставить("НаборСвойствПодписиКЭДО", РеквизитыПодписей.Получить(СвойстваПодписи.ИдентификаторПодписи));
		СвойстваПодписи.Вставить("ИмяФайла",
			КадровыйЭДОВызовСервера.ИмяФайлаПодписи(
				ИмяФайлаПодписиОбъекта(Объект),
				Подписи.Количество() > 1,
				НомерПодписи));
		НомерПодписи = НомерПодписи + 1;
	КонецЦикла;
	
	Возврат Подписи;
	
КонецФункции

Процедура ЗаполнитьПодписиВФорме(УправляемаяФорма, СсылкаНаОбъект) Экспорт
	
	УправляемаяФорма.ЭлектронныеПодписи.Очистить();
	ЦифровыеПодписиОбъекта = ЭлектронныеПодписиДокумента(СсылкаНаОбъект, УправляемаяФорма.УникальныйИдентификатор);
	Для Каждого ЦифроваяПодписьОбъекта Из ЦифровыеПодписиОбъекта Цикл
		СтрокаПодписи = УправляемаяФорма.ЭлектронныеПодписи.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПодписи, ЦифроваяПодписьОбъекта);
	КонецЦикла;
	
КонецПроцедуры

Функция ДанныеМЧДПодписи(МЧД, ИдентификаторХранилища) Экспорт
	
	Если МЧД <> Неопределено Тогда
		
		ОписаниеДоверенности = ОписаниеМЧД();
		
		УстановитьПривилегированныйРежим(Истина);
		ФайлДоверенности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МЧД, "ФайлДоверенности");
		ДанныеФайла = РаботаСФайлами.ДанныеФайла(ФайлДоверенности);
		ДанныеДоверенности = ПолучитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
		УстановитьПривилегированныйРежим(Ложь);
		
		ОписаниеДоверенности.Ссылка = МЧД;
		ОписаниеДоверенности.Доверенность = ПоместитьВоВременноеХранилище(ДанныеДоверенности, ИдентификаторХранилища);
		ОписаниеДоверенности.ИмяФайлаСРасширением = КадровыйЭДОВызовСервера.ИмяВыгружаемогоФайлаМЧД(МЧД);
		
		ОписаниеДоверенности.Размер = ДанныеДоверенности.Размер();
		
		ПодписиМЧД = УстановленныеПодписи(ФайлДоверенности);
		Для Каждого ПодписьМЧД Из ПодписиМЧД Цикл
			ОписаниеПодписи = ОписаниеПодписиМЧД();
			ОписаниеПодписи.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(
				ПодписьМЧД.Подпись, ИдентификаторХранилища);
			ОписаниеПодписи.ИмяФайлаСРасширением = ПодписьМЧД.ИмяФайла;
			Если ПодписьМЧД.НаборСвойствПодписиКЭДО <> Неопределено Тогда
				ОписаниеПодписи.НаборСвойствПодписиКЭДО = Новый Массив;
				Для Каждого ОписаниеСвойств Из ОписаниеПодписи.НаборСвойствПодписиКЭДО Цикл
					ОписаниеСвойствПодписи = Новый Структура("МЧД,РольПодписанта");
					ОписаниеПодписи.НаборСвойствПодписиКЭДО.Добавить(ОписаниеСвойствПодписи);
					ОписаниеСвойствПодписи.РольПодписанта = ОписаниеСвойств.РольПодписанта;
					Если ЗначениеЗаполнено(ОписаниеСвойств.МЧД) Тогда
						ОписаниеСвойствПодписи.МЧД = ДанныеМЧДПодписи(ОписаниеСвойств.МЧД, ИдентификаторХранилища);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			ОписаниеДоверенности.Подписи.Добавить(ОписаниеПодписи);
		КонецЦикла;
		
		Возврат ОписаниеДоверенности;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ОрганизацияМЧД(МЧД) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Доверитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МЧД, "Доверитель");
	УстановитьПривилегированныйРежим(Ложь);
	Если ЗначениеЗаполнено(Доверитель)
		И ТипЗнч(Доверитель) = Тип("СправочникСсылка.Организации") Тогда
		
		Возврат Доверитель;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	УстановленныеПодписи = УстановленныеПодписи(МЧД);
	УстановитьПривилегированныйРежим(Ложь);
	Для Каждого СвойстваПодписи Из УстановленныеПодписи Цикл
		ДополнительныеСвойства = Неопределено;
		Если СвойстваПодписи.Свойство("ДополнительныеСвойства", ДополнительныеСвойства) Тогда
			Если ДополнительныеСвойства <> Неопределено Тогда
				Для Каждого ДанныеПодписи Из ДополнительныеСвойства Цикл
					Если ЗначениеЗаполнено(ДанныеПодписи.МЧД) Тогда
						Организация = ОрганизацияМЧД(МЧД);
						Если ЗначениеЗаполнено(Организация) Тогда
							Возврат Организация;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗарегистрироватьНаборСвойствПодписи(Знач Объект, Знач ИдентификаторПодписи, Знач РольПодписанта) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ИдентификаторПодписи) = Тип("Строка") Тогда
		ИдентификаторПодписи = Новый УникальныйИдентификатор(ИдентификаторПодписи);
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ЭлектронныеПодписиКЭДО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПодписанныйОбъект.Установить(Объект);
	НаборЗаписей.Отбор.ИдентификаторПодписи.Установить(ИдентификаторПодписи);
	Запись = НаборЗаписей.Добавить();
	Запись.ПодписанныйОбъект 	= Объект;
	Запись.ИдентификаторПодписи = ИдентификаторПодписи;
	Запись.РольПодписанта    = РольПодписанта;
	НаборЗаписей.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
 
Функция ИмяФайлаПодписиОбъекта(Объект)
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.МашиночитаемыеДоверенности") Тогда
		Возврат КадровыйЭДОВызовСервера.ИмяВыгружаемогоФайлаМЧД(Объект);
	КонецЕсли;
	
	Возврат КадровыйЭДОВызовСервера.ИмяФайлаКЭДО(Строка(Объект));
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытий

Процедура ЗапомнитьУстановленныеПодписи(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.Отбор.ПодписанныйОбъект.Использование Тогда
		Если Не ЗарплатаКадры.ЭтоОбъектЗарплатноКадровойБиблиотеки(Источник.Отбор.ПодписанныйОбъект.Значение.Метаданные().ПолноеИмя()) Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭлектронныеПодписи.ПодписанныйОбъект КАК ПодписанныйОбъект,
		|	ЭлектронныеПодписи.ИдентификаторПодписи КАК ИдентификаторПодписи
		|ИЗ
		|	РегистрСведений.ЭлектронныеПодписи КАК ЭлектронныеПодписи
		|ГДЕ
		|	&ТекстОтбора";
	
	ТекстОтбора = "(ИСТИНА)";
	ТекстыОтбора = Новый Массив;
	Для Каждого ЭлементОтбора Из Источник.Отбор Цикл
		Если ЭлементОтбора.Использование Тогда
			ЛевоеЗначение = ЭлементОтбора.ПутьКДанным;
			Запрос.УстановитьПараметр(ЛевоеЗначение, ЭлементОтбора.Значение);
			ТекстыОтбора.Добавить("(ЭлектронныеПодписи." + ЛевоеЗначение + " = &" + ЛевоеЗначение + ")");
		КонецЕсли;
	КонецЦикла;
	Если ЗначениеЗаполнено(ТекстыОтбора) Тогда
		ТекстОтбора = СтрСоединить(ТекстыОтбора, " И ");
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтбора", ТекстОтбора);
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеПодписей = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Источник.ДополнительныеСвойства.Вставить("ДанныеПодписей", ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеПодписей));
	Источник.ДополнительныеСвойства.Вставить("РеквизитыУстановленныхПодписей",
		ЭлектроннаяПодписьКЭДОПовтИсп.РеквизитыУстановленныхПодписей(
			Источник.Отбор.ПодписанныйОбъект.Значение));
	
	Если КадровыйЭДО.ЭтоЭлектронныйДокумент(Источник.Отбор.ПодписанныйОбъект.Значение) Тогда
		Источник.ДополнительныеСвойства.Вставить("ОтпечаткиСертификатов",
			ОтпечаткиСертификатовПодписейОбъекта(Источник.Отбор.ПодписанныйОбъект.Значение));
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьДанныеЭлектронныхПодписей(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ДанныеПодписей") Тогда
		ЗаписиОбоихНаборов = Новый Массив;
		ТаблицаПодписей = Источник.Выгрузить();
		Для Каждого ДанныеПодписи Из Источник.ДополнительныеСвойства.ДанныеПодписей Цикл
			ЗаписиПодписи = ТаблицаПодписей.НайтиСтроки(ДанныеПодписи);
			Если ЗаписиПодписи.Количество() = 0 Тогда
				НаборЗаписей = РегистрыСведений.ЭлектронныеПодписиКЭДО.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ПодписанныйОбъект.Установить(ДанныеПодписи.ПодписанныйОбъект);
				НаборЗаписей.Отбор.ИдентификаторПодписи.Установить(ДанныеПодписи.ИдентификаторПодписи);
				НаборЗаписей.Записать();
			Иначе
				ЗаписиОбоихНаборов.Добавить(ЗаписиПодписи[0]);
				ДанныеИдентификатораПодписи = Источник.ДополнительныеСвойства.РеквизитыУстановленныхПодписей.Получить(ДанныеПодписи.ИдентификаторПодписи);
				Если ДанныеИдентификатораПодписи <> Неопределено Тогда
					Для Каждого ДанныеПодписи Из ДанныеИдентификатораПодписи Цикл
						ЗарегистрироватьНаборСвойствПодписи(
							Источник.Отбор.ПодписанныйОбъект.Значение, ЗаписиПодписи[0].ИдентификаторПодписи, ДанныеПодписи.РольПодписанта);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Для Каждого ДанныеПодписи Из ТаблицаПодписей Цикл
			Если ЗаписиОбоихНаборов.Найти(ДанныеПодписи) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ДанныеИдентификатораПодписи = Источник.ДополнительныеСвойства.РеквизитыУстановленныхПодписей.Получить(ДанныеПодписи.ИдентификаторПодписи);
			Если ДанныеИдентификатораПодписи <> Неопределено Тогда
				Для Каждого ДанныеПодписи Из ДанныеИдентификатораПодписи Цикл
					ЗарегистрироватьНаборСвойствПодписи(
						Источник.Отбор.ПодписанныйОбъект.Значение, ДанныеПодписи.ИдентификаторПодписи, ДанныеПодписи.РольПодписанта);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ОтпечаткиСертификатов") Тогда
		Если Не ОбщегоНазначения.КоллекцииИдентичны(Источник.ДополнительныеСвойства.ОтпечаткиСертификатов,
			ОтпечаткиСертификатовПодписейОбъекта(Источник.Отбор.ПодписанныйОбъект.Значение)) Тогда
			
			КадровыйЭДО.ЗарегистрироватьФайлыДокументовКЭДОКПересчетуСостояний(Источник.Отбор.ПодписанныйОбъект.Значение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция РеквизитыУстановленныхПодписей(Объект, ИдентификаторПодписи = Неопределено) Экспорт
	
	РеквизитыПодписей = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодписанныйОбъект", Объект);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭлектронныеПодписиКЭДО.ИдентификаторПодписи КАК ИдентификаторПодписи,
		|	ЭлектронныеПодписиКЭДО.РольПодписанта КАК РольПодписанта,
		|	ЕСТЬNULL(ЭлектронныеПодписиМЧД.МашиночитаемаяДоверенность, НЕОПРЕДЕЛЕНО) КАК МЧД
		|ИЗ
		|	РегистрСведений.ЭлектронныеПодписиКЭДО КАК ЭлектронныеПодписиКЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭлектронныеПодписи КАК ЭлектронныеПодписи
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭлектронныеПодписиМЧД КАК ЭлектронныеПодписиМЧД
		|			ПО ЭлектронныеПодписи.ПодписанныйОбъект = ЭлектронныеПодписиМЧД.ПодписанныйОбъект
		|				И ЭлектронныеПодписи.ИдентификаторПодписи = ЭлектронныеПодписиМЧД.ИдентификаторПодписи
		|		ПО ЭлектронныеПодписиКЭДО.ПодписанныйОбъект = ЭлектронныеПодписи.ПодписанныйОбъект
		|			И ЭлектронныеПодписиКЭДО.ИдентификаторПодписи = ЭлектронныеПодписи.ИдентификаторПодписи
		|ГДЕ
		|	ЭлектронныеПодписиКЭДО.ПодписанныйОбъект = &ПодписанныйОбъект
		|	И &ОтборПоИдентификаторуПодписи
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИдентификаторПодписи,
		|	МЧД";
	
	Если ИдентификаторПодписи = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоИдентификаторуПодписи", "(ИСТИНА)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоИдентификаторуПодписи", "ЭлектронныеПодписиКЭДО.ИдентификаторПодписи = &ИдентификаторПодписи");
		Запрос.УстановитьПараметр("ИдентификаторПодписи", ИдентификаторПодписи);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.СледующийПоЗначениюПоля("ИдентификаторПодписи") Цикл
		ДанныеИдентификатораПодписи = Новый Массив;
		РеквизитыПодписей.Вставить(Выборка.ИдентификаторПодписи, ДанныеИдентификатораПодписи);
		Пока Выборка.Следующий() Цикл
			ДанныеИдентификатораПодписи.Добавить(
				Новый Структура("МЧД,РольПодписанта",
					Выборка.МЧД,
					Выборка.РольПодписанта));
		КонецЦикла;
	КонецЦикла;
	
	Возврат РеквизитыПодписей;
	
КонецФункции

Функция ОписаниеМЧД()
	
	ОписаниеДоверенности = Новый Структура;
	ОписаниеДоверенности.Вставить("Ссылка");
	ОписаниеДоверенности.Вставить("Доверенность");
	ОписаниеДоверенности.Вставить("ИмяФайлаСРасширением", "");
	ОписаниеДоверенности.Вставить("Размер", 0);
	ОписаниеДоверенности.Вставить("Подписи", Новый Массив);
	
	Возврат ОписаниеДоверенности;
	
КонецФункции

Функция ОписаниеПодписиМЧД()
	
	ОписаниеПодписи = Новый Структура;
	ОписаниеПодписи.Вставить("АдресВоВременномХранилище");
	ОписаниеПодписи.Вставить("ИмяФайлаСРасширением", "");
	ОписаниеПодписи.Вставить("НаборСвойствПодписиКЭДО");
	
	Возврат ОписаниеПодписи;
	
КонецФункции

Функция ОтпечаткиСертификатовПодписейОбъекта(Объект)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодписанныйОбъект", Объект);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЭлектронныеПодписи.Отпечаток КАК Отпечаток
		|ИЗ
		|	РегистрСведений.ЭлектронныеПодписи КАК ЭлектронныеПодписи
		|ГДЕ
		|	ЭлектронныеПодписи.ПодписанныйОбъект = &ПодписанныйОбъект";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Отпечаток");
	
КонецФункции

Функция ЭлектронныеПодписиДокумента(СсылкаНаОбъект, Знач ИдентификаторХранилища = Неопределено) 
	
	Если ИдентификаторХранилища = Неопределено Тогда
		ИдентификаторХранилища = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	ЦифровыеПодписи = Новый Массив;
	ЦифровыеПодписиОбъекта = УстановленныеПодписи(СсылкаНаОбъект);
	Для Каждого ЦифроваяПодписьОбъекта Из ЦифровыеПодписиОбъекта Цикл
		
		ЦифроваяПодписьОбъекта.Вставить("Объект", СсылкаНаОбъект);
		АдресПодписи = ПоместитьВоВременноеХранилище(
			ЦифроваяПодписьОбъекта.Подпись, ИдентификаторХранилища);
		ЦифроваяПодписьОбъекта.Вставить("АдресПодписи", АдресПодписи);
		
		ДвоичныеДанныеСертификата = ЦифроваяПодписьОбъекта.Сертификат.Получить();
		Если ДвоичныеДанныеСертификата <> Неопределено Тогда 
			ЦифроваяПодписьОбъекта.Вставить("АдресСертификата",  ПоместитьВоВременноеХранилище(
				ДвоичныеДанныеСертификата, ИдентификаторХранилища));
		КонецЕсли;
		
		ЦифроваяПодписьОбъекта.Вставить("Статус", "");
		ЭлектроннаяПодписьКЭДОКлиентСервер.ЗаполнитьСтатусПроверкиПодписиОбъекта(ЦифроваяПодписьОбъекта);
		
		ЦифровыеПодписи.Добавить(ЦифроваяПодписьОбъекта);
		
	КонецЦикла;
	
	Возврат ЦифровыеПодписи;
	
КонецФункции

#КонецОбласти
